GopalSaraf/Practicals/PSDL/include/proc/pic16f1936.inc
// Register: CCPR3L
#define CCPR3L CCPR3L
CCPR3L                                   equ 0311h
// bitfield definitions
CCPR3L_CCPR3L_POSN                       equ 0000h
CCPR3L_CCPR3L_POSITION                   equ 0000h
CCPR3L_CCPR3L_SIZE                       equ 0008h
CCPR3L_CCPR3L_LENGTH                     equ 0008h
CCPR3L_CCPR3L_MASK                       equ 00FFh

// Register: CCPR3H
#define CCPR3H CCPR3H
CCPR3H                                   equ 0312h
// bitfield definitions
CCPR3H_CCPR3H_POSN                       equ 0000h
CCPR3H_CCPR3H_POSITION                   equ 0000h
CCPR3H_CCPR3H_SIZE                       equ 0008h
CCPR3H_CCPR3H_LENGTH                     equ 0008h
CCPR3H_CCPR3H_MASK                       equ 00FFh

// Register: CCP3CON
#define CCP3CON CCP3CON
CCP3CON                                  equ 0313h
// bitfield definitions
CCP3CON_CCP3M0_POSN                      equ 0000h
CCP3CON_CCP3M0_POSITION                  equ 0000h
CCP3CON_CCP3M0_SIZE                      equ 0001h
CCP3CON_CCP3M0_LENGTH                    equ 0001h
CCP3CON_CCP3M0_MASK                      equ 0001h
CCP3CON_CCP3M1_POSN                      equ 0001h
CCP3CON_CCP3M1_POSITION                  equ 0001h
CCP3CON_CCP3M1_SIZE                      equ 0001h
CCP3CON_CCP3M1_LENGTH                    equ 0001h
CCP3CON_CCP3M1_MASK                      equ 0002h
CCP3CON_CCP3M2_POSN                      equ 0002h
CCP3CON_CCP3M2_POSITION                  equ 0002h
CCP3CON_CCP3M2_SIZE                      equ 0001h
CCP3CON_CCP3M2_LENGTH                    equ 0001h
CCP3CON_CCP3M2_MASK                      equ 0004h
CCP3CON_CCP3M3_POSN                      equ 0003h
CCP3CON_CCP3M3_POSITION                  equ 0003h
CCP3CON_CCP3M3_SIZE                      equ 0001h
CCP3CON_CCP3M3_LENGTH                    equ 0001h
CCP3CON_CCP3M3_MASK                      equ 0008h
CCP3CON_DC3B0_POSN                       equ 0004h
CCP3CON_DC3B0_POSITION                   equ 0004h
CCP3CON_DC3B0_SIZE                       equ 0001h
CCP3CON_DC3B0_LENGTH                     equ 0001h
CCP3CON_DC3B0_MASK                       equ 0010h
CCP3CON_DC3B1_POSN                       equ 0005h
CCP3CON_DC3B1_POSITION                   equ 0005h
CCP3CON_DC3B1_SIZE                       equ 0001h
CCP3CON_DC3B1_LENGTH                     equ 0001h
CCP3CON_DC3B1_MASK                       equ 0020h
CCP3CON_P3M0_POSN                        equ 0006h
CCP3CON_P3M0_POSITION                    equ 0006h
CCP3CON_P3M0_SIZE                        equ 0001h
CCP3CON_P3M0_LENGTH                      equ 0001h
CCP3CON_P3M0_MASK                        equ 0040h
CCP3CON_P3M1_POSN                        equ 0007h
CCP3CON_P3M1_POSITION                    equ 0007h
CCP3CON_P3M1_SIZE                        equ 0001h
CCP3CON_P3M1_LENGTH                      equ 0001h
CCP3CON_P3M1_MASK                        equ 0080h

// Register: PWM3CON
#define PWM3CON PWM3CON
PWM3CON                                  equ 0314h
// bitfield definitions
PWM3CON_P3DC0_POSN                       equ 0000h
PWM3CON_P3DC0_POSITION                   equ 0000h
PWM3CON_P3DC0_SIZE                       equ 0001h
PWM3CON_P3DC0_LENGTH                     equ 0001h
PWM3CON_P3DC0_MASK                       equ 0001h
PWM3CON_P3DC1_POSN                       equ 0001h
PWM3CON_P3DC1_POSITION                   equ 0001h
PWM3CON_P3DC1_SIZE                       equ 0001h
PWM3CON_P3DC1_LENGTH                     equ 0001h
PWM3CON_P3DC1_MASK                       equ 0002h
PWM3CON_P3DC2_POSN                       equ 0002h
PWM3CON_P3DC2_POSITION                   equ 0002h
PWM3CON_P3DC2_SIZE                       equ 0001h
PWM3CON_P3DC2_LENGTH                     equ 0001h
PWM3CON_P3DC2_MASK                       equ 0004h
PWM3CON_P3DC3_POSN                       equ 0003h
PWM3CON_P3DC3_POSITION                   equ 0003h
PWM3CON_P3DC3_SIZE                       equ 0001h
PWM3CON_P3DC3_LENGTH                     equ 0001h
PWM3CON_P3DC3_MASK                       equ 0008h
PWM3CON_P3DC4_POSN                       equ 0004h
PWM3CON_P3DC4_POSITION                   equ 0004h
PWM3CON_P3DC4_SIZE                       equ 0001h
PWM3CON_P3DC4_LENGTH                     equ 0001h
PWM3CON_P3DC4_MASK                       equ 0010h
PWM3CON_P3DC5_POSN                       equ 0005h
PWM3CON_P3DC5_POSITION                   equ 0005h
PWM3CON_P3DC5_SIZE                       equ 0001h
PWM3CON_P3DC5_LENGTH                     equ 0001h
PWM3CON_P3DC5_MASK                       equ 0020h
PWM3CON_P3DC6_POSN                       equ 0006h
PWM3CON_P3DC6_POSITION                   equ 0006h
PWM3CON_P3DC6_SIZE                       equ 0001h
PWM3CON_P3DC6_LENGTH                     equ 0001h
PWM3CON_P3DC6_MASK                       equ 0040h
PWM3CON_P3RSEN_POSN                      equ 0007h
PWM3CON_P3RSEN_POSITION                  equ 0007h
PWM3CON_P3RSEN_SIZE                      equ 0001h
PWM3CON_P3RSEN_LENGTH                    equ 0001h
PWM3CON_P3RSEN_MASK                      equ 0080h

// Register: CCP3AS
#define CCP3AS CCP3AS
CCP3AS                                   equ 0315h
// bitfield definitions
CCP3AS_PSS3BD0_POSN                      equ 0000h
CCP3AS_PSS3BD0_POSITION                  equ 0000h
CCP3AS_PSS3BD0_SIZE                      equ 0001h
CCP3AS_PSS3BD0_LENGTH                    equ 0001h
CCP3AS_PSS3BD0_MASK                      equ 0001h
CCP3AS_PSS3BD1_POSN                      equ 0001h
CCP3AS_PSS3BD1_POSITION                  equ 0001h
CCP3AS_PSS3BD1_SIZE                      equ 0001h
CCP3AS_PSS3BD1_LENGTH                    equ 0001h
CCP3AS_PSS3BD1_MASK                      equ 0002h
CCP3AS_PSS3AC0_POSN                      equ 0002h
CCP3AS_PSS3AC0_POSITION                  equ 0002h
CCP3AS_PSS3AC0_SIZE                      equ 0001h
CCP3AS_PSS3AC0_LENGTH                    equ 0001h
CCP3AS_PSS3AC0_MASK                      equ 0004h
CCP3AS_PSS3AC1_POSN                      equ 0003h
CCP3AS_PSS3AC1_POSITION                  equ 0003h
CCP3AS_PSS3AC1_SIZE                      equ 0001h
CCP3AS_PSS3AC1_LENGTH                    equ 0001h
CCP3AS_PSS3AC1_MASK                      equ 0008h
CCP3AS_CCP3AS0_POSN                      equ 0004h
CCP3AS_CCP3AS0_POSITION                  equ 0004h
CCP3AS_CCP3AS0_SIZE                      equ 0001h
CCP3AS_CCP3AS0_LENGTH                    equ 0001h
CCP3AS_CCP3AS0_MASK                      equ 0010h
CCP3AS_CCP3AS1_POSN                      equ 0005h
CCP3AS_CCP3AS1_POSITION                  equ 0005h
CCP3AS_CCP3AS1_SIZE                      equ 0001h
CCP3AS_CCP3AS1_LENGTH                    equ 0001h
CCP3AS_CCP3AS1_MASK                      equ 0020h
CCP3AS_CCP3AS2_POSN                      equ 0006h
CCP3AS_CCP3AS2_POSITION                  equ 0006h
CCP3AS_CCP3AS2_SIZE                      equ 0001h
CCP3AS_CCP3AS2_LENGTH                    equ 0001h
CCP3AS_CCP3AS2_MASK                      equ 0040h
CCP3AS_CCP3ASE_POSN                      equ 0007h
CCP3AS_CCP3ASE_POSITION                  equ 0007h
CCP3AS_CCP3ASE_SIZE                      equ 0001h
CCP3AS_CCP3ASE_LENGTH                    equ 0001h
CCP3AS_CCP3ASE_MASK                      equ 0080h

// Register: PSTR3CON
#define PSTR3CON PSTR3CON
PSTR3CON                                 equ 0316h
// bitfield definitions
PSTR3CON_STR3A_POSN                      equ 0000h
PSTR3CON_STR3A_POSITION                  equ 0000h
PSTR3CON_STR3A_SIZE                      equ 0001h
PSTR3CON_STR3A_LENGTH                    equ 0001h
PSTR3CON_STR3A_MASK                      equ 0001h
PSTR3CON_STR3B_POSN                      equ 0001h
PSTR3CON_STR3B_POSITION                  equ 0001h
PSTR3CON_STR3B_SIZE                      equ 0001h
PSTR3CON_STR3B_LENGTH                    equ 0001h
PSTR3CON_STR3B_MASK                      equ 0002h
PSTR3CON_STR3C_POSN                      equ 0002h
PSTR3CON_STR3C_POSITION                  equ 0002h
PSTR3CON_STR3C_SIZE                      equ 0001h
PSTR3CON_STR3C_LENGTH                    equ 0001h
PSTR3CON_STR3C_MASK                      equ 0004h
PSTR3CON_STR3D_POSN                      equ 0003h
PSTR3CON_STR3D_POSITION                  equ 0003h
PSTR3CON_STR3D_SIZE                      equ 0001h
PSTR3CON_STR3D_LENGTH                    equ 0001h
PSTR3CON_STR3D_MASK                      equ 0008h
PSTR3CON_STR3SYNC_POSN                   equ 0004h
PSTR3CON_STR3SYNC_POSITION               equ 0004h
PSTR3CON_STR3SYNC_SIZE                   equ 0001h
PSTR3CON_STR3SYNC_LENGTH                 equ 0001h
PSTR3CON_STR3SYNC_MASK                   equ 0010h

// Register: CCPR4L
#define CCPR4L CCPR4L
CCPR4L                                   equ 0318h
// bitfield definitions
CCPR4L_CCPR4L_POSN                       equ 0000h
CCPR4L_CCPR4L_POSITION                   equ 0000h
CCPR4L_CCPR4L_SIZE                       equ 0008h
CCPR4L_CCPR4L_LENGTH                     equ 0008h
CCPR4L_CCPR4L_MASK                       equ 00FFh

// Register: CCPR4H
#define CCPR4H CCPR4H
CCPR4H                                   equ 0319h
// bitfield definitions
CCPR4H_CCPR4H_POSN                       equ 0000h
CCPR4H_CCPR4H_POSITION                   equ 0000h
CCPR4H_CCPR4H_SIZE                       equ 0008h
CCPR4H_CCPR4H_LENGTH                     equ 0008h
CCPR4H_CCPR4H_MASK                       equ 00FFh

// Register: CCP4CON
#define CCP4CON CCP4CON
CCP4CON                                  equ 031Ah
// bitfield definitions
CCP4CON_CCP4M0_POSN                      equ 0000h
CCP4CON_CCP4M0_POSITION                  equ 0000h
CCP4CON_CCP4M0_SIZE                      equ 0001h
CCP4CON_CCP4M0_LENGTH                    equ 0001h
CCP4CON_CCP4M0_MASK                      equ 0001h
CCP4CON_CCP4M1_POSN                      equ 0001h
CCP4CON_CCP4M1_POSITION                  equ 0001h
CCP4CON_CCP4M1_SIZE                      equ 0001h
CCP4CON_CCP4M1_LENGTH                    equ 0001h
CCP4CON_CCP4M1_MASK                      equ 0002h
CCP4CON_CCP4M2_POSN                      equ 0002h
CCP4CON_CCP4M2_POSITION                  equ 0002h
CCP4CON_CCP4M2_SIZE                      equ 0001h
CCP4CON_CCP4M2_LENGTH                    equ 0001h
CCP4CON_CCP4M2_MASK                      equ 0004h
CCP4CON_CCP4M3_POSN                      equ 0003h
CCP4CON_CCP4M3_POSITION                  equ 0003h
CCP4CON_CCP4M3_SIZE                      equ 0001h
CCP4CON_CCP4M3_LENGTH                    equ 0001h
CCP4CON_CCP4M3_MASK                      equ 0008h
CCP4CON_DC4B0_POSN                       equ 0004h
CCP4CON_DC4B0_POSITION                   equ 0004h
CCP4CON_DC4B0_SIZE                       equ 0001h
CCP4CON_DC4B0_LENGTH                     equ 0001h
CCP4CON_DC4B0_MASK                       equ 0010h
CCP4CON_DC4B1_POSN                       equ 0005h
CCP4CON_DC4B1_POSITION                   equ 0005h
CCP4CON_DC4B1_SIZE                       equ 0001h
CCP4CON_DC4B1_LENGTH                     equ 0001h
CCP4CON_DC4B1_MASK                       equ 0020h

// Register: CCPR5L
#define CCPR5L CCPR5L
CCPR5L                                   equ 031Ch
// bitfield definitions
CCPR5L_CCPR5L_POSN                       equ 0000h
CCPR5L_CCPR5L_POSITION                   equ 0000h
CCPR5L_CCPR5L_SIZE                       equ 0008h
CCPR5L_CCPR5L_LENGTH                     equ 0008h
CCPR5L_CCPR5L_MASK                       equ 00FFh

// Register: CCPR5H
#define CCPR5H CCPR5H
CCPR5H                                   equ 031Dh
// bitfield definitions
CCPR5H_CCPR5H_POSN                       equ 0000h
CCPR5H_CCPR5H_POSITION                   equ 0000h
CCPR5H_CCPR5H_SIZE                       equ 0008h
CCPR5H_CCPR5H_LENGTH                     equ 0008h
CCPR5H_CCPR5H_MASK                       equ 00FFh

